АлогистикТест2/src/Documents/алк_РасформированиеПакетов/алк_РасформированиеПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_РасформированиеПакетов</name>
  <basedOn>Document.алк_ПеремещениеЗапасов</basedOn>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизацииСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиПродукция</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыНаСкладахСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>InformationRegister.алк_ПараметрыПакетов</registerRecords>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_ПеремещениеЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>переупаковка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыПакетов/алк_ПараметрыПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыПакетов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НомерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодПакета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСостав</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодУпаковки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>БоковаяДоска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </resources>
  <resources>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>Сухой</name>
    <comment>Для пакетов СП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакНЗП</name>
    <type>
      <types>EnumRef.алк_ПризнакНЗП</types>
    </type>
  </resources>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/ОперацииСерийныхНомеров/ОперацииСерийныхНомеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииСерийныхНомеров</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Движение</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>Переупаковка</name>
  </enumValues>
  <enumValues>
    <name>Расформирование</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Перевалка</name>
  </enumValues>
  <enumValues>
    <name>Судно</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_ВидыОперацийПеремещениеЗапасов/алк_ВидыОперацийПеремещениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыОперацийПеремещениеЗапасов</name>
  <enumValues>
    <name>ПередачаИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ВозвратНаПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеРасформированныхПакетов</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаУпаковку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСобственные</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаРеализацию</name>
  </enumValues>
  <enumValues>
    <name>РеализацияЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>РасформированиеПакета</name>
  </enumValues>
  <enumValues>
    <name>ПередачаСПереупаковки</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаОтветхранение</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаС_ЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаПереупаковку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСушку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаССушки</name>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаВСушильнуюКамеру</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаИзСушильнойКамеры</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВНезавершенноеПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПередачаСНезавершенногоПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаНаСГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаССушкиСырых</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УПП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УРП_СГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УРП_Магазин</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_ВидыДвиженияПроизводствоОборот/алк_ВидыДвиженияПроизводствоОборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыДвиженияПроизводствоОборот</name>
  <enumValues>
    <name>Списано</name>
  </enumValues>
  <enumValues>
    <name>Оприходовано</name>
  </enumValues>
  <enumValues>
    <name>Отходы</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Catalogs/алк_ОперацииПроизводства/алк_ОперацииПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>алк_ОперацииПроизводства</name>
  <predefined>
    <items>
      <name>Досушка</name>
      <description>Досушка</description>
    </items>
    <items>
      <name>Дробление</name>
      <description>Дробление</description>
    </items>
    <items>
      <name>Лущение</name>
      <description>Лущение</description>
    </items>
    <items>
      <name>Окорка</name>
      <description>Окорка</description>
    </items>
    <items>
      <name>Отгрузка</name>
      <description>Отгрузка</description>
    </items>
    <items>
      <name>ОтгрузкаСудна</name>
      <description>Отгрузка судна</description>
    </items>
    <items>
      <name>ПереданоВОтгрузку</name>
      <description>Передано в отгрузку</description>
    </items>
    <items>
      <name>ПеремещениеПриход</name>
      <description>Перемещение приход</description>
    </items>
    <items>
      <name>ПеремещениеРасход</name>
      <description>Перемещение расход</description>
    </items>
    <items>
      <name>Пересортица</name>
      <description>Пересортица</description>
    </items>
    <items>
      <name>Переупаковка</name>
      <description>Переупаковка</description>
    </items>
    <items>
      <name>Прибыло</name>
      <description>Прибыло</description>
    </items>
    <items>
      <name>Приемка</name>
      <description>Приемка</description>
    </items>
    <items>
      <name>ПриемкаВПорту</name>
      <description>Приемка в порту</description>
    </items>
    <items>
      <name>ПриемкаПоГОСТ</name>
      <description>Приемка по ГОСТ</description>
    </items>
    <items>
      <name>ПроизводствоПоддонов</name>
      <description>Производство поддонов</description>
    </items>
    <items>
      <name>ПроизводствоТопливныхБрикетов</name>
      <description>Производство топливных брикетов</description>
    </items>
    <items>
      <name>ПроизводствоФанеры</name>
      <description>Производство фанеры</description>
    </items>
    <items>
      <name>Разгружено</name>
      <description>Разгружено</description>
    </items>
    <items>
      <name>Распил</name>
      <description>Распил</description>
    </items>
    <items>
      <name>Ребросклей</name>
      <description>Ребросклей</description>
    </items>
    <items>
      <name>РучнаяСортировка</name>
      <description>Ручная сортировка</description>
    </items>
    <items>
      <name>СборкаРазборкаПакета</name>
      <description>Сборка/Разборка пакета</description>
    </items>
    <items>
      <name>Списание</name>
      <description>Списание</description>
    </items>
    <items>
      <name>Сушка</name>
      <description>Сушка</description>
    </items>
    <items>
      <name>Упаковка</name>
      <description>Упаковка</description>
    </items>
    <items>
      <name>УпаковкаФанеры</name>
      <description>Упаковка фанеры</description>
    </items>
    <items>
      <name>ФорматнаяОбрезка</name>
      <description>Форматная обрезка</description>
    </items>
    <items>
      <name>ЧисленныйСоставСмены</name>
      <description>Численный состав смены (общая)</description>
    </items>
    <items>
      <name>ШлифованиеФанеры</name>
      <description>Шлифование фанеры</description>
    </items>
  </predefined>
  <attributes>
    <name>ЗапросПолученияБюджета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросПолученияПлана</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросПолученияФакта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОперацииДляЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>63</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантИтогов</name>
    <type>
      <types>EnumRef.алк_ВариантыИтогов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗависитОтОпераций</name>
    <comment>Используется в механизме расчета показателей для настраиваемых отчетов</comment>
    <attributes>
      <name>ОперацияПроизводства</name>
      <type>
        <types>CatalogRef.алк_ОперацииПроизводства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеВТ</name>
    <attributes>
      <name>ВТ</name>
      <type>
        <types>CatalogRef.алк_ВТ_ДляРасчетаПоказателейПроизводства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Documents/алк_РасформированиеПакетов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область Инициализация
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаРасформированиеПакетов, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_РасформированиеПакетовЗапасы.Ссылка.Дата КАК ДатаСобытия,
		|	алк_РасформированиеПакетовЗапасы.Ссылка.Дата КАК Период,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииСерийныхНомеров.Расформирование) КАК Операция,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика,
		|	алк_РасформированиеПакетовЗапасы.СерийныйНомер,
		|	алк_РасформированиеПакетовЗапасы.Номенклатура,
		|	алк_ПараметрыПакетовСрезПоследних.Сертификат
		|ИЗ
		|	Документ.алк_РасформированиеПакетов.Запасы КАК алк_РасформированиеПакетовЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(, ) КАК алк_ПараметрыПакетовСрезПоследних
		|		ПО алк_РасформированиеПакетовЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ГДЕ
		|	алк_РасформированиеПакетовЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_РасформированиеПакетовЗапасы.Ссылка.Организация,
		|	алк_РасформированиеПакетовЗапасы.Ссылка.СтруктурнаяЕдиница,
		|	алк_РасформированиеПакетовЗапасы.Ссылка.Ячейка,
		|	алк_РасформированиеПакетовЗапасы.СерийныйНомер,
		|	&ВидДвиженияНакопленияРасход КАК ВидДвижения,
		|	алк_РасформированиеПакетовЗапасы.Ссылка.Дата КАК Период,
		|	алк_РасформированиеПакетовЗапасы.КоличествоПакетов,
		|	алк_РасформированиеПакетовЗапасы.Номенклатура,
		|	алк_РасформированиеПакетовЗапасы.Ссылка.ДатаСмены,
		|	алк_РасформированиеПакетовЗапасы.Ссылка.Смена,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииСерийныхНомеров.Расформирование) КАК Операция
		|ИЗ
		|	Документ.алк_РасформированиеПакетов.Запасы КАК алк_РасформированиеПакетовЗапасы
		|ГДЕ
		|	алк_РасформированиеПакетовЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_РасформированиеПакетов.Организация,
		|	алк_РасформированиеПакетов.Дата КАК Период,
		|	алк_РасформированиеПакетов.ДатаСмены,
		|	алк_РасформированиеПакетов.Смена,
		|	&Момент КАК МоментПроведения,
		|	&Сотрудник
		|ИЗ
		|	Документ.алк_РасформированиеПакетов КАК алк_РасформированиеПакетов
		|ГДЕ
		|	алк_РасформированиеПакетов.Ссылка = &Ссылка";
		
		
		ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнойОтветственный");
		ОсновнойОтветственный = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.Сотрудники.ПустаяСсылка());
		
		Запрос.УстановитьПараметр("Сотрудник", ОсновнойОтветственный);
		Запрос.УстановитьПараметр("Момент", ТекущаяУниверсальнаяДатаВМиллисекундах()); 
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасформированиеПакетов);
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияРасход", ВидДвиженияНакопления.Расход);  
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		// Серийные номера
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераГарантии", МассивРезультатов[0].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладахСерии", МассивРезультатов[1].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДокументыПослПродукция", МассивРезультатов[2].Выгрузить());
		
		СформироватьТаблицаЗапасыОрганизации(ДокументСсылкаРасформированиеПакетов, СтруктураДополнительныеСвойства);
		
		СформироватьТаблицаЗапасыОрганизацииСерии(ДокументСсылкаРасформированиеПакетов, СтруктураДополнительныеСвойства); 
		
		//Пакушев И.С. 2023.11.10 //Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов ++
		Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(ДокументСсылкаРасформированиеПакетов.Дата) Тогда
			СформироватьТаблицуПроизводствоОборот(ДокументСсылкаРасформированиеПакетов, СтруктураДополнительныеСвойства);
			СформироватьТаблицуОстаткиЗапасов(ДокументСсылкаРасформированиеПакетов, СтруктураДополнительныеСвойства);
		КонецЕсли;
		//Пакушев И.С. 2023.11.10 //Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов --

		
	КонецПроцедуры // ИнициализироватьДанныеДокумента() 
	
	#КонецОбласти 
	
	
	#Область Проведение
	
	// Формирует таблицу значений, содержащую данные для проведения по регистру.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура СформироватьТаблицаЗапасыОрганизации(ДокументСсылкаРасформированиеПакетов, СтруктураДополнительныеСвойства)
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_РасформированиеПакетовЗапасы.Номенклатура,
		|	&ВидДвиженияНакопленияПриход КАК ВидДвижения,
		|	&Период,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПолучениеРасформированныхПакетов) КАК Операция,
		|	алк_РасформированиеПакетовЗапасы.Ссылка.Организация,
		|	алк_РасформированиеПакетовЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	алк_РасформированиеПакетовЗапасы.Ссылка.Ячейка КАК Ячейка,
		|	алк_РасформированиеПакетовЗапасы.Ссылка.ДатаСмены,
		|	алк_РасформированиеПакетовЗапасы.Ссылка.Смена,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика,
		|	алк_ПараметрыПакетовСрезПоследних.КоличествоСостав КАК Количество,
		|	алк_ПараметрыПакетовСрезПоследних.Объем,
		|	алк_ПараметрыПакетовСрезПоследних.Сертификат
		|ИЗ
		|	Документ.алк_РасформированиеПакетов.Запасы КАК алк_РасформированиеПакетовЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
		|				&Период,
		|				СерийныйНомер В
		|					(ВЫБРАТЬ
		|						алк_РасформированиеПакетовЗапасы.СерийныйНомер КАК СерийныйНомер
		|					ИЗ
		|						Документ.алк_РасформированиеПакетов.Запасы КАК алк_РасформированиеПакетовЗапасы
		|					ГДЕ
		|						алк_РасформированиеПакетовЗапасы.Ссылка = &Ссылка)) КАК алк_ПараметрыПакетовСрезПоследних
		|		ПО алк_РасформированиеПакетовЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ГДЕ
		|	алк_РасформированиеПакетовЗапасы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_РасформированиеПакетовЗапасы.Номенклатура,
		|	&ВидДвиженияНакопленияРасход,
		|	&Период,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПолучениеРасформированныхПакетов),
		|	алк_РасформированиеПакетовЗапасы.Ссылка.Организация,
		|	алк_РасформированиеПакетовЗапасы.Ссылка.СтруктурнаяЕдиница,
		|	ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка),
		|	алк_РасформированиеПакетовЗапасы.Ссылка.ДатаСмены,
		|	алк_РасформированиеПакетовЗапасы.Ссылка.Смена,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика,
		|	алк_ПараметрыПакетовСрезПоследних.КоличествоСостав,
		|	алк_ПараметрыПакетовСрезПоследних.Объем,
		|	алк_ПараметрыПакетовСрезПоследних.Сертификат
		|ИЗ
		|	Документ.алк_РасформированиеПакетов.Запасы КАК алк_РасформированиеПакетовЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
		|				&Период,
		|				СерийныйНомер В
		|					(ВЫБРАТЬ
		|						алк_РасформированиеПакетовЗапасы.СерийныйНомер КАК СерийныйНомер
		|					ИЗ
		|						Документ.алк_РасформированиеПакетов.Запасы КАК алк_РасформированиеПакетовЗапасы
		|					ГДЕ
		|						алк_РасформированиеПакетовЗапасы.Ссылка = &Ссылка)) КАК алк_ПараметрыПакетовСрезПоследних
		|		ПО алк_РасформированиеПакетовЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ГДЕ
		|	алк_РасформированиеПакетовЗапасы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияПриход", ВидДвиженияНакопления.Приход);
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияРасход", ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаРасформированиеПакетов.Дата);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасформированиеПакетов);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыОрганизации", МассивРезультатов[0].Выгрузить());
		
		
	КонецПроцедуры // СформироватьТаблицаЗапасыОрганизации
	
	// Формирует таблицу значений, содержащую данные для проведения по регистру.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура СформироватьТаблицаЗапасыОрганизацииСерии(ДокументСсылкаРасформированиеПакетов, СтруктураДополнительныеСвойства)
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_РасформированиеПакетовЗапасы.Номенклатура,
		|	&ВидДвиженияНакопления КАК ВидДвижения,
		|	&Период,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыОперацийПеремещениеЗапасов.РасформированиеПакета) КАК Операция,
		|	алк_РасформированиеПакетовЗапасы.Ссылка.Организация,
		|	алк_РасформированиеПакетовЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	алк_РасформированиеПакетовЗапасы.Ссылка.Ячейка КАК Ячейка,
		|	алк_РасформированиеПакетовЗапасы.Ссылка.ДатаСмены,
		|	алк_РасформированиеПакетовЗапасы.Ссылка.Смена,
		|	алк_РасформированиеПакетовЗапасы.СерийныйНомер,
		|	алк_РасформированиеПакетовЗапасы.КоличествоПакетов
		|ИЗ
		|	Документ.алк_РасформированиеПакетов.Запасы КАК алк_РасформированиеПакетовЗапасы
		|ГДЕ
		|	алк_РасформированиеПакетовЗапасы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("ВидДвиженияНакопления", ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаРасформированиеПакетов.Дата);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасформированиеПакетов);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыОрганизацииСерии", МассивРезультатов[0].Выгрузить());
		
		
	КонецПроцедуры // СформироватьТаблицаЗапасыОрганизации
	
	
	Процедура СформироватьТаблицуПроизводствоОборот(ДокументСсылкаРасформированиеПакетов, СтруктураДополнительныеСвойства)
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_РасформированиеПакетовЗапасы.Ссылка.Дата,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Списано) КАК ВидДвиженияПроизводства,
		|	алк_РасформированиеПакетовЗапасы.Ссылка.Организация,
		|	алк_РасформированиеПакетовЗапасы.Номенклатура КАК Номенклатура,
		|	алк_РасформированиеПакетовЗапасы.СерийныйНомер КАК СерийныйНомер,
		|	алк_ПараметрыПакетовСрезПоследних.Сертификат КАК Сертификат,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика КАК Характеристика,
		|	алк_ПараметрыПакетовСрезПоследних.Объем КАК Количество,
		|	ВЫБОР
		|		КОГДА алк_РасформированиеПакетовЗапасы.СерийныйНомер.Наименование ПОДОБНО ""СП-%""
		|				ИЛИ алк_РасформированиеПакетовЗапасы.СерийныйНомер.Наименование ПОДОБНО ""МС-%""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Распил)
		|		КОГДА алк_РасформированиеПакетовЗапасы.СерийныйНомер.Наименование ПОДОБНО ""НЗ-%""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка)
		|	КОНЕЦ КАК Операция,
		|	алк_РасформированиеПакетовЗапасы.Ссылка.ДатаСмены,
		|	алк_РасформированиеПакетовЗапасы.Ссылка.Смена,
		|	алк_РасформированиеПакетовЗапасы.Ссылка.СтруктурнаяЕдиница
		|ПОМЕСТИТЬ ВТ_Списание
		|ИЗ
		|	Документ.алк_РасформированиеПакетов.Запасы КАК алк_РасформированиеПакетовЗапасы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
		|				,
		|				СерийныйНомер В
		|					(ВЫБРАТЬ
		|						алк_РасформированиеПакетовЗапасы.СерийныйНомер
		|					ИЗ
		|						Документ.алк_РасформированиеПакетов.Запасы КАК алк_РасформированиеПакетовЗапасы
		|					ГДЕ
		|						алк_РасформированиеПакетовЗапасы.Ссылка = &Ссылка)) КАК алк_ПараметрыПакетовСрезПоследних
		|		ПО алк_РасформированиеПакетовЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ГДЕ
		|	алк_РасформированиеПакетовЗапасы.Ссылка.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Списание.Дата КАК Период,
		|	ВТ_Списание.ВидДвиженияПроизводства КАК ВидДвиженияПроизводства,
		|	ВТ_Списание.ДатаСмены КАК ДатаСмены,
		|	ВТ_Списание.Номенклатура КАК Номенклатура,
		|	ВТ_Списание.Организация КАК Организация,
		|	ВТ_Списание.СерийныйНомер КАК СерийныйНомер,
		|	ВТ_Списание.Сертификат КАК Сертификат,
		|	ВТ_Списание.Смена КАК Смена,
		|	ВТ_Списание.Характеристика КАК Характеристика,
		|	ВТ_Списание.Операция КАК Операция
		|ИЗ
		|	ВТ_Списание КАК ВТ_Списание";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасформированиеПакетов);
		
		ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПроизводствоОборот", ТаблицаРезультата);
		
	КонецПроцедуры
	
	Процедура СформироватьТаблицуОстаткиЗапасов(ДокументСсылкаРасформированиеПакетов, СтруктураДополнительныеСвойства)
		
		Запрос = Новый  Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_РасформированиеПакетовЗапасы.Ссылка.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	алк_РасформированиеПакетовЗапасы.Ссылка.Организация,
		|	алк_РасформированиеПакетовЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	алк_РасформированиеПакетовЗапасы.Номенклатура КАК Номенклатура,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика КАК Характеристика,
		|	алк_ПараметрыПакетовСрезПоследних.Сертификат КАК Сертификат,
		|	алк_РасформированиеПакетовЗапасы.СерийныйНомер КАК СерийныйНомер,
		|	алк_ПараметрыПакетовСрезПоследних.Объем КАК Количество
		|ПОМЕСТИТЬ ВТ_Списание
		|ИЗ
		|	Документ.алк_РасформированиеПакетов.Запасы КАК алк_РасформированиеПакетовЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
		|				,
		|				СерийныйНомер В
		|					(ВЫБРАТЬ
		|						алк_РасформированиеПакетовЗапасы.СерийныйНомер
		|					ИЗ
		|						Документ.алк_РасформированиеПакетов.Запасы КАК алк_РасформированиеПакетовЗапасы
		|					ГДЕ
		|						алк_РасформированиеПакетовЗапасы.Ссылка = &Ссылка)) КАК алк_ПараметрыПакетовСрезПоследних
		|		ПО алк_РасформированиеПакетовЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ГДЕ
		|	алк_РасформированиеПакетовЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Списание.Период,
		|	ВТ_Списание.ВидДвижения,
		|	ВТ_Списание.Организация,
		|	ВТ_Списание.СтруктурнаяЕдиница,
		|	ВТ_Списание.Номенклатура,
		|	ВТ_Списание.Характеристика,
		|	ВТ_Списание.Сертификат,
		|	ВТ_Списание.СерийныйНомер,
		|	ВТ_Списание.Количество
		|ИЗ
		|	ВТ_Списание КАК ВТ_Списание";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасформированиеПакетов);
		
		ТаблицаРезультата = Запрос.Выполнить().Выгрузить();	
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов", ТаблицаРезультата);
		
	КонецПроцедуры
		
	
	// Заполняет список команд печати.
	// 
	// Параметры:
	//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
	//
	Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
		
	КонецПроцедуры
	
	#КонецОбласти 
	
#КонецЕсли
